app/controllers/home_controller.rb

	def get_featured_image
	  prod = Product.find(params[:id])
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 3 LIMIT 1