app/controllers/products_controller.rb

SELECT  `products`.* FROM `products`  ORDER BY id LIMIT 20 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM `products` LIMIT 20 OFFSET 0) subquery_for_count
---
  def index
    @products = Product.paginate :per_page => 20, :page => params[:page], :order => 'title'

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
  def detail
    @product = Product.find(params[:id])

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
	def get_thumb_image
	  prod = Product.find(params[:id])

SELECT  `products`.* FROM `products` WHERE `products`.`id` = 1 LIMIT 1
---
	def get_picture_image
	  prod = Product.find(params[:id])