app/views/products/detail.html.erb

									<div class="gotham-light-forced-line large-font"><%= @product.title %></div>
									<div class="gotham-light-forced-long-line medium-font">by <%= @product.author.first_name %> <%= @product.author.last_name %></div>
---
SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 1 LIMIT 1