app/views/products/index.html.erb

SELECT  `authors`.* FROM `authors` WHERE `authors`.`id` = 1 LIMIT 1
---
									<div class="gotham-light-forced-long-line medium-font"><%= product.subtitle %></div>
									<div class="gotham-light-forced-long-line normal-font">by <%= product.author.first_name %> <%= product.author.last_name %></div>